library(shinysurveys)
library(shiny)
library(shinythemes)
library(shinyjs)
library(shinyFeedback)
library(shinytitle)
library(shinyWidgets)
library(RMySQL)
library(pool)
library(DBI)


# pool <- pool::dbPool(
#  drv = RMySQL::MySQL(),
#  dbname = "quest",
#  host = "127.0.0.1",
#  username = "root",
#  password = "WIN72007@NAZAr"
# )

pool <- pool::dbPool(
  drv = RMySQL::MySQL(),
  dbname = "heroku_623d565686a87a4",
  host = "eu-cluster-west-01.k8s.cleardb.net",
  username = "bc6a3dad916b4a",
  password = "0c7f407f"
)

onStop(function() {
  print("POOL CLOSED!!!!!!!!!!!!!")
  poolClose(pool)
})


# questions <- data.frame(
#   question = c(rep("Виберіть ваше відділення:", 160), 
#                
#                rep("НА РІВНІ КЕРІВНИКА",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА  ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА  ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ  ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА   ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА   ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ   ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА    ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА    ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ    ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА     ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА     ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ     ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА      ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА      ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ      ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА       ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА       ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ       ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА        ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА        ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ        ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА         ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА         ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ         ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА          ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА          ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ          ",6),
#                
#                rep("НА РІВНІ КЕРІВНИКА           ",6),
#                rep("НА РІВНІ ЗАМ.КЕРІВНИКА           ", 6),
#                rep("НА РІВНІ ЕКОНОМІСТІВ           ",6)),
#   
#   option = option <- c("0 відділення",	"1 відділення",	"2 відділення",	"3 відділення",	"4 відділення",	"5 відділення",	"6 відділення",	"7 відділення",	"8 відділення",	"9 відділення",	"10 відділення",	"11 відділення",	"12 відділення",	"13 відділення",	"14 відділення",	"15 відділення",	"16 відділення",	"17 відділення",	"18 відділення",	"19 відділення",	"20 відділення",	"21 відділення",	"22 відділення",	"23 відділення",	"24 відділення",	"25 відділення",	"26 відділення",	"27 відділення",	"28 відділення",	"29 відділення",	"30 відділення",	"31 відділення",	"32 відділення",	"33 відділення",	"34 відділення",	"35 відділення",	"36 відділення",	"37 відділення",	"38 відділення",	"39 відділення",	"40 відділення",	"41 відділення",	"42 відділення",	"43 відділення",	"44 відділення",	"45 відділення",	"46 відділення",	"47 відділення",	"48 відділення",	"49 відділення",	"50 відділення",	"51 відділення",	"52 відділення",	"53 відділення",	"54 відділення",	"55 відділення",	"56 відділення",	"57 відділення",	"58 відділення",	"59 відділення",	"60 відділення",	"61 відділення",	"62 відділення",	"63 відділення",	"64 відділення",	"65 відділення",	"66 відділення",	"67 відділення",	"68 відділення",	"69 відділення",	"70 відділення",	"71 відділення",	"72 відділення",	"73 відділення",	"74 відділення",	"75 відділення",	"76 відділення",	"77 відділення",	"78 відділення",	"79 відділення",	"80 відділення",	"81 відділення",	"82 відділення",	"83 відділення",	"84 відділення",	"85 відділення",	"86 відділення",	"87 відділення",	"88 відділення",	"89 відділення",	"90 відділення",	"91 відділення",	"92 відділення",	"93 відділення",	"94 відділення",	"95 відділення",	"96 відділення",	"97 відділення",	"98 відділення",	"99 відділення",	"100 відділення",	"101 відділення",	"102 відділення",	"103 відділення",	"104 відділення",	"105 відділення",	"106 відділення",	"107 відділення",	"108 відділення",	"109 відділення",	"110 відділення",	"111 відділення",	"112 відділення",	"113 відділення",	"114 відділення",	"115 відділення",	"116 відділення",	"117 відділення",	"118 відділення",	"119 відділення",	"120 відділення",	"121 відділення",	"122 відділення",	"123 відділення",	"124 відділення",	"125 відділення",	"126 відділення",	"127 відділення",	"128 відділення",	"129 відділення",	"130 відділення",	"131 відділення",	"132 відділення",	"133 відділення",	"134 відділення",	"135 відділення",	"136 відділення",	"137 відділення",	"138 відділення",	"139 відділення",	"140 відділення",	"141 відділення",	"142 відділення",	"143 відділення",	"144 відділення",	"145 відділення",	"146 відділення",	"147 відділення",	"148 відділення",	"149 відділення",	"150 відділення",	"151 відділення",	"152 відділення",	"153 відділення",	"154 відділення",	"155 відділення",	"156 відділення",	"157 відділення",	"158 відділення",	"159 відділення",
#                        "0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5"),
#   input_type = c(rep("picker", 160), rep("matrix", 216)),
#   # For matrix questions, the IDs should be the same for each question
#   # but different for each matrix input unit
#   input_id = c(rep("division", 160), rep("q11", 18),rep("q12", 18),rep("q13", 18),rep("q21", 18),rep("q22", 18),rep("q23", 18),rep("q31", 18),rep("q32", 18),rep("q33", 18),rep("q41", 18),rep("q42", 18),rep("q43", 18)),
#   dependence = NA,
#   dependence_value = NA,
#   required = TRUE
#   #page = c(rep(1, 214), rep(2, 54), rep(3, 54), rep(4, 54))
# )

questions <- data.frame(
  question = c(rep("Виберіть ваше відділення:", 160),rep("Введіть ПІБ працівника відділення?", 399), 

               rep("ОЦІНКА",6),
               

               rep("ОЦІНКА ",6),

               rep("ОЦІНКА  ",6),


               rep("ОЦІНКА   ",6),


               rep("ОЦІНКА    ",6),

               rep("ОЦІНКА     ",6),

               rep("ОЦІНКА      ",6),


               rep("ОЦІНКА       ",6),


               rep("ОЦІНКА        ",6),


               rep("ОЦІНКА         ",6),

               rep("ОЦІНКА          ",6),


               rep("ОЦІНКА           ",6)),

  option = option <- c("0 відділення",	"1 відділення",	"2 відділення",	"3 відділення",	"4 відділення",	"5 відділення",	"6 відділення",	"7 відділення",	"8 відділення",	"9 відділення",	"10 відділення",	"11 відділення",	"12 відділення",	"13 відділення",	"14 відділення",	"15 відділення",	"16 відділення",	"17 відділення",	"18 відділення",	"19 відділення",	"20 відділення",	"21 відділення",	"22 відділення",	"23 відділення",	"24 відділення",	"25 відділення",	"26 відділення",	"27 відділення",	"28 відділення",	"29 відділення",	"30 відділення",	"31 відділення",	"32 відділення",	"33 відділення",	"34 відділення",	"35 відділення",	"36 відділення",	"37 відділення",	"38 відділення",	"39 відділення",	"40 відділення",	"41 відділення",	"42 відділення",	"43 відділення",	"44 відділення",	"45 відділення",	"46 відділення",	"47 відділення",	"48 відділення",	"49 відділення",	"50 відділення",	"51 відділення",	"52 відділення",	"53 відділення",	"54 відділення",	"55 відділення",	"56 відділення",	"57 відділення",	"58 відділення",	"59 відділення",	"60 відділення",	"61 відділення",	"62 відділення",	"63 відділення",	"64 відділення",	"65 відділення",	"66 відділення",	"67 відділення",	"68 відділення",	"69 відділення",	"70 відділення",	"71 відділення",	"72 відділення",	"73 відділення",	"74 відділення",	"75 відділення",	"76 відділення",	"77 відділення",	"78 відділення",	"79 відділення",	"80 відділення",	"81 відділення",	"82 відділення",	"83 відділення",	"84 відділення",	"85 відділення",	"86 відділення",	"87 відділення",	"88 відділення",	"89 відділення",	"90 відділення",	"91 відділення",	"92 відділення",	"93 відділення",	"94 відділення",	"95 відділення",	"96 відділення",	"97 відділення",	"98 відділення",	"99 відділення",	"100 відділення",	"101 відділення",	"102 відділення",	"103 відділення",	"104 відділення",	"105 відділення",	"106 відділення",	"107 відділення",	"108 відділення",	"109 відділення",	"110 відділення",	"111 відділення",	"112 відділення",	"113 відділення",	"114 відділення",	"115 відділення",	"116 відділення",	"117 відділення",	"118 відділення",	"119 відділення",	"120 відділення",	"121 відділення",	"122 відділення",	"123 відділення",	"124 відділення",	"125 відділення",	"126 відділення",	"127 відділення",	"128 відділення",	"129 відділення",	"130 відділення",	"131 відділення",	"132 відділення",	"133 відділення",	"134 відділення",	"135 відділення",	"136 відділення",	"137 відділення",	"138 відділення",	"139 відділення",	"140 відділення",	"141 відділення",	"142 відділення",	"143 відділення",	"144 відділення",	"145 відділення",	"146 відділення",	"147 відділення",	"148 відділення",	"149 відділення",	"150 відділення",	"151 відділення",	"152 відділення",	"153 відділення",	"154 відділення",	"155 відділення",	"156 відділення",	"157 відділення",	"158 відділення",	"159 відділення",
                       "Салюта Альона Анатоліївна",	"Крупка Тетяна Сергіївна",	"Кот Максим Миколайович",	"Головня Ірина Вікторівна",	"Баранецька Ольга Яківна",	"Олійник Інна Всеволодівна",	"Язичян Світлана Юріївна",	"Неділько Лідія Михайлівна",	"Кадацька Олена Володимирівна",	"Кобилко Наталія Іванівна",	"Волох Тетяна Євгенівна",	"Марків Олеся Василівна",	"Копча Наталія Володимирівна",	"Халавчук Ольга Петрівна",	"Яницький Ярослав Володимирович",	"Бацюн Аліна Вікторівна",	"Ставратій Аріна Василівна",	"Дзюба Тетяна Станіславівна",	"Мерчук Віталій Сергійович",	"Федченко Дар'я Юріївна",	"Чернецька Світлана Романівна",	"Чернявська Світлана Олександрівна",	"Зуділова Ірина Миколаївна",	"Барабуха Оксана Юріївна",	"Чернік Олександр Олександрович",	"Корж Оксана Юріївна",	"Бенюх Аліна Анатоліївна",	"Степаненко Ірина Валеріївна",	"Чемерис Олена Володимирівна",	"Філіповська Ірина Анатоліївна",	"Козубовська Ірина Василівна",	"Кравець Наталія Вікторівна",	"Горогоцька Тетяна Миколаївна",	"Терещенко Ірина Василівна",	"Колосовська Ольга Ігорівна",	"Шевченко Віталія Віталіївна",	"Рубан Вікторія Сергіївна",	"Клюшниченко Дарія Юріївна",	"Петренко Діана Євгеніївна",	"Мельник Марія Юріївна",	"Храпач Артур Сергійович",	"Гуц Людмила Анатоліївна",	"Шайденко Оксана Владиславівна",	"Бойко Юлія Альбертівна",	"Порохня Віктор Олександрович",	"Неделько Юлія Леонідівна",	"Врублевська Світлана Анатоліївна",	"Петришин Оксана Романівна",	"Сірик Людмила Іванівна",	"Гончаренко Олена Сергіївна",	"Кустов Юрій Леонідович",	"Кармелюк Вікторія Михайлівна",	"Молочківська Вікторія Сергіївна",	"Сороківська Олена Віталіївна",	"Шматко Людмила Анатоліївна",	"Решетник Ганна Володимирівна",	"Котелянець Юрій Володимирович",	"Репіна Альона Володимирівна",	"Голуб Ріта Федорівна",	"Салащенко Ельвіра Анатоліївна",	"Закотій Андрій Михайлович",	"Наговська Яна Анатоліївна",	"Коцаренко Віталій Олександрович",	"Шахметова Гюзель Гаязівна",	"Макарєєва Наталія Іванівна",	"Бондар Ірина Іванівна",	"Федорцова Наталія Леонідівна",	"Лебединська Маріанна Володимирівна",	"Карапуд Юлія Олегівна",	"Сафоненко Лариса Геннадіївна",	"Бойко Анастасія Володимирівна",	"Костик Оксана Вікторівна",	"Власенко Олександра Василівна",	"Ярічук Ольга Володимирівна",	"Сахарова Олена Юріївна",	"Діденко Юлія Сергіївна",	"Сафрончик Тетяна Олексіївна",	"Брік Наталія Леонідівна",	"Стоєва Оксана Геннадіївна",	"Зінькова Віталія Володимирівна",	"Феник Олександр Юрійович",	"Райлян Ярослава Олександрівна",	"Федченко Ольга Петрівна",	"Аксюк Станіслав Вікторович",	"Ткаченко Альона Валеріївна",	"Копія Ілля Васильович",	"Степаненко Ірина Григорівна",	"Зайцева Юлія Ігорівна",	"Майорова Олена Василівна",	"Островська Катерина Вадимівна",	"Владова Ольга Сергіївна",	"Саночкіна Тетяна Михайлівна",	"Тараненко Олена Василівна",	"Штурмаревич Костянтин Ігорович",	"Гончаренко Наталія Валеріївна",	"Змій Валентина Володимирівна",	"Прокоф'їчева Марина Євгеніївна",	"Корж Елла Геннадіївна",	"Денисенко Оксана Володимирівна",	"Тронь Леся Миколаївна",	"Величко Людмила Миколаївна",	"Давидова Маргарита Олександрівна",	"Михайленко Олена Вікторівна",	"Мірошниченко Роман Віталійович",	"Євченко Руслана Іванівна",	"Северин Лариса Василівна",	"Дяченко Тетяна Вікторівна",	"Череда Світлана Володимирівна",	"Беспалько Євген Едуардович",	"Туник Олена Андріївна",	"Куданович Ольга Сергіївна",	"Санжарівський Олексій Петрович",	"Зозуля Юлія Сергіївна",	"Бойчук Ірина Володимирівна",	"Котвіцька Віра Богданівна",	"Луговська Тетяна Сергіївна",	"Качусов Костянтин Валентинович",	"Кащак Ольга Богданівна",	"Стефанів Олена Іванівна",	"Кардаш Ірина Степанівна",	"Головчанська Аліна Юріївна",	"Кузнецова Юлія Вікторівна",	"Морозова Олександра Ігорівна",	"Мухіна Олена Володимирівна",	"Діденко Дмитро Валерійович",	"Гончаренко Наталія Валеріївна",	"Тчинецька Галина Станіславівна",	"Русецька Вікторія Василівна",	"Дементович Богдана Романівна",	"Ігнатченко Аліна Володимирівна",	"Черненко Ігор Миколайович",	"Петришин Оксана Романівна",	"Шпак Катерина Василівна",	"Бенецька Оксана Володимирівна",	"Русецька Вікторія Василівна",	"Кисіль Юлія Олегівна",	"Алавердян Норік",	"Клименко Олена Михайлівна",	"Доденко Оксана Володимирівна",	"Воля Володимир Вікторович",	"Бугаєць Людмила Олександрівна",	"Копосова Олена Миколаївна",	"Подлубний Денис Володимирович",	"Дерев`янко Олексій Вікторович",	"Реуцька Оксана Володимирівна",	"Кириченко Олена Тарасівна",	"Семьонова Оксана Володимирівна",	"Бенецька Оксана Володимирівна",	"Бабенко Ксенія Юріївна",	"Христенко Юлія Валентинівна",	"Колядіна Наталія Ігорівна",	"Чекір Галина Василівна",	"Багута Марина Сергіївна",	"Фурман Людмила Миколаївна",	"Мураш Олена Павлівна",	"Павтулова Олена Вікторівна",	"Сердечна Наталія Петрівна",	"Тупіленко Наталія Олександрівна",	"Тетерятник Ірина Анатоліївна",	"Нікітіна Вікторія Юріївна",	"Голубєва Ірина Михайлівна",	"Кременчутська Вікторія Олексіївна",	"Самойлюк Ігор Васильович",	"Білик Володимир Олександрович",	"Гейленко Анастасія Дмитрівна",	"Красій Оксана Григорівна",	"Надашкевич Ірина Альвинівна",	"Обушко Ірина Володимирівна",	"Клейман Тетяна Віталіївна",	"Новосельська Наталія Володимирівна",	"Гордієнко Юлія Сергіївна",	"Яремчук Микола Євгенович",	"Радченко Ганна Олександрівна",	"Жаркова Ірина Анатоліївна",	"Бакшеєва Оксана Миколаївна",	"Ястребова Яна Вячеславівна",	"Зубик Євгенія Леонідівна",	"Шевкун Оксана Петрівна",	"Хитрик Лариса Петрівна",	"Троїцька Наталія Вікторівна",	"Бережна Юлія Олександрівна",	"Чеверьова Ірина Вікторівна",	"Демчук Олена Владиславівна",	"Гецко Оксана Володимирівна",	"Шпонтак Вероніка Віталіївна",	"Мазур Іванна Олександрівна",	"Грищенко Надія Іванівна",	"Бобрик Юлія Костянтинівна",	"Вороніна Людмила Андріївна",	"Шевченко Наталія Олександрівна",	"Муха Ірина Анатоліївна",	"Рибалка Анастасія Вікторівна",	"Йорж Андрій Володимирович",	"Стружко Інна Олександрівна",	"Леонова Катерина Миколаївна",	"Войков Валерій Валерійович",	"Пономаренко Людмила Миколаївна",	"Ільєнко Наталія Олександрівна",	"Чещева Інна Вікторівна",	"Шумарин Сергій Вікторович",	"Дядечкіна Світлана Василівна",	"Осіпова Наталія Олександрівна",	"Головко Надія Миколаївна",	"Філатова Ольга Сергіївна",	"Даніліна Юлія Вікторівна",	"Нестеренко Ігор Борисович",	"Суханова Тетяна Сергіївна",	"Кочан Наталя Михайлівна",	"Подаленчук Сергій Павлович",	"Сизова Олена Григорівна",	"Рибакова Катерина Олексіївна",	"Бойко Євгенія Олександрівна",	"Дергач Марія Вадимівна",	"Ломако Роман Дмитрович",	"Папченко Тетяна Андріївна",	"Перепелиця Алла Володимирівна",	"Тупчій Віталій Анатолійович",	"Кабанчук Олена Миколаївна",	"Рубан Юлія Вікторівна",	"Белінський Костянтин Володимирович",	"Ніколаєва Євгенія Валентинівна",	"Карнаух Марина Вікторівна",	"Осінчук Анастасія Ігорівна",	"Гавриленко Христина Генріківна",	"Некипелов Володимир Іванович",	"Мекшун Тетяна Володимирівна",	"Саломатова Оксана Михайлівна",	"Обміняна Вікторія Петрівна",	"Малнацька Тетяна Дмитрівна",	"Сєдлецька Ірина Сергіївна",	"Зубрицький Назар Вікторович",	"Берлізєва Тетяна Леонідівна",	"Яцько Тетяна Степанівна",	"Марко Людмила Василівна",	"Лакуста Ірина Степанівна",	"Борисенко Тетяна Миколаївна",	"Мисник Світлана Олександрівна",	"Гурт Володимир Станіславович",	"Коваленко Роман Іванович",	"Сокуренко Тетяна Григорівна",	"Рябініна Олена Володимирівна",	"Цимбалюк Оксана Ігорівна",	"Маланій Микола Петрович",	"Радько Анна Олександрівна",	"Івах Геннадій Владиславович",	"Тягленко Оксана Вікторівна",	"Фост Юлія Юріївна",	"Козирєва Ірина Миколаївна",	"Бережний Тимофій Григорович",	"Серединська Тетяна Петрівна",	"Кухарчук Олена Василівна",	"Шпак Катерина Василівна",	"Рибак Людмила Григорівна",	"Швець Інна Олегівна",	"Маренко Максим Петрович",	"Плитус Ірина Василівна",	"Маркова Наталія Валентинівна",	"Гавриш Наталія Миколаївна",	"Хахалина Євген Дмитрович",	"Щупель Ганна Миколаївна",	"Салецька Олена В'ячеславівна",	"Гончар Юлія Михайлівна",	"Гаврилюк Алла Леонідівна",	"Гамувка Олена Миколаївна",	"Питель Алла Петрівна",	"Разкевич Ольга Михайлівна",	"Загоруйко Наталя Петрівна",	"Данилишен Євгеній Васильович",	"Чистюхін Максим Геррадійович",	"Ярмош Тетяна Сергіївна",	"Карпова Ірина Сергіївна",	"Явтушенко Юлія Петрівна",	"Скрипинська Наталя Миколаївна",	"Савуляк Мар`яна Василівна",	"Улізько Ірина Геннадіївна",	"Бойко Олексій Васильович",	"Лохова Ірина Петрівна",	"Горобець Наталя Олександрівна",	"Пилипець Ганна Едуардівна",	"Якубовська Олена Володимирівна",	"Білозор Наталія Іванівна",	"Крищук Олеся Євгеніївна",	"Бойко Анна Олександрівна",	"Романенко Наталія Валеріївна",	"Рудь Юлія Михайлівна",	"Дубовик Анастасія Андріївна",	"Урбанович Лілія Петрівна",	"Нечай Оксана Мирославівна",	"Козловський Володимир Валерійович",	"Баран Людмила Михайлівна",	"Пось Світлана Миколаївна",	"Курченко Інна Георгіївна",	"Макаренко Людмила Ігорівна",	"Федишин Оксана Василівна",	"Романишин Іван Володимрович",	"Нестеренко Ігор Борисович",	"Супрун Оксана Володимирівна",	"Крохмаль Яна Анатоліївна",	"Кузін Світлана Іванівна",	"Лісовська Тетяна Михайлівна",	"Дубик Уляна Василівна",	"Буга Ірина Володимирівна",	"Кирилюк Руслан Ростиславович",	"Орлик Світлана Вікторівна",	"Діхтяренко Наталія Степанівна",	"Мороз Валентина Володимирівна",	"Кисляк Тетяна Михайлівна",	"Чмут Яна Вікторівна",	"Бутенко Наталія Володимирівна",	"Лисько Богдан Анатолійович",	"Шамрай Катерина Сергіївна",	"Рибак Олена Василівна",	"Власюк Ірина Миколаївна",	"Прус Ірина Сергіївна",	"Михайлова Ольга Валеріївна",	"Барсук Галина Іванівна",	"Шпак Наталія Дмитрівна",	"Івановська Анастасія Вячеславівна",	"Худавердян Кристина Петросівна",	"Копія Вікторія Сергіївна",	"Куріліна Яна Олександрівна",	"Кабанов Дмитро Володимирович",	"Кузьоменська Юлія Юріївна",	"Левішко Ганна Олександрівна",	"Морякова Юлія Юріївна",	"Дрига Марина Михайлівна",	"Іщенко Олександра Миколаївна",	"Журавель Вікторія Петрівна",	"Вітт Євгенія Костянтинівна",	"Коваленко Оксана Валентинівна",	"Оніщук Оксана Михайлівна",	"Нагорна Тетяна Миколаївна",	"Гаврилюк Катерина Василівна",	"Сущик Людмила Володимирівна",	"Литвинчук Олександр Юрійович",	"Рощенко Оксана Олександрівна",	"Басок Сергій Володимирович",	"Шнайдер Людмила Миколаївна",	"Шубіна Юлія Вікторівна",	"Скачкова Наталя Петрівна",	"Нетребко Володимир Вікторович",	"Андрющенко Ростислав Русланович",	"Дзюба Роман Андрійович",	"Нікітіна Олена Валеріївна",	"Цепова Олександра Андріївна",	"Кажанов Станіслав Андрійович",	"Кулибанич Тетяна Валеріївна",	"Полікарпова Вікторія Михайлівна",	"Чернецька Світлана Романівна",	"Кеба Владислав Вячеславович",	"Саєнко Олена Анатоліївна",	"Коростіль Олена Миколаївна",	"Жданович Ірина Миколаївна",	"Собченко Ганна Леонідівна",	"Коляда Людмила Петрівна",	"Васильєва Вікторія Євгенівна",	"Есманова Анастасія Анатоліївна",	"Праведнікова Дар`я Олександрівна",	"Малина Ольга Анатоліївна",	"Нікуліна Юлія Аліковна",	"Крива Вікторія Анатоліївна",	"Левенець Аліна Анатоліївна",	"Остапчук Олександр Віталійович",	"Коломієць Ганна Анатоліївна",	"Соловюк Світлана Дмитрівна",	"Сватуха Олена Вікторівна",	"Полєва Алла Миколаївна",	"Продажець Вікторія Сергіївна",	"Скіпчик Юрій Миколайович",	"Новак Володимир Миколайович",	"Вініченко Марія Олексіївна",	"Буряк Діана Станіславівна",	"Подорогіна Галина Сергіївна",	"Карпенко Ольга Вікторівна",	"Слободенюк Інна Василівна",	"Кравцова Наталія Анатоліївна",	"Палій Ірина Вікторівна",	"Ременець Марія Сергіївна",	"Загорянський Дмитро Євгенович",	"Гогенко Карина Сергіївна",	"Федорова Марина Валеріївна",	"Гончар Олена Миколаївна",	"Грішанова Інна Вікторівна",	"Іванченко Марія Сергіївна",	"Кирилаха Наталія Іванівна",	"Ревелюк Олена Сергіївна",	"Петренко Олена Олександрівна",	"Шрамченко Оксана Валентинівна",	"Ткаченко Яна Анатоліївна",	"Дерев'янко Тетяна Володимирівна",	"Смик Інна Василівна",	"Гайдук Руслан Олександрович",	"Коломійчук Тетяна Сергіївна",	"Вакуленко Ірина Олександрівна",	"Онищенко Юлія Володимирівна",	"Луценко Юлія Іванівна",	"Брозянський Євген Олександрович",	"Магнетова Дарина Сергіївна",	"Горелков Юрій Вікторович",
                       
"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5",	"0",	"1",	"2",	"3",	"4",	"5"),
  input_type = c(rep("picker", 160), rep("PIBselector", 399), rep("matrix", 72)),
  # For matrix questions, the IDs should be the same for each question
  # but different for each matrix input unit
  input_id = c(rep("division", 160), rep("PIB", 399), rep("q11", 6),rep("q12", 6),rep("q13", 6),rep("q21", 6),rep("q22", 6),rep("q23", 6),rep("q31", 6),rep("q32", 6),rep("q33", 6),rep("q41", 6),rep("q42", 6),rep("q43", 6)),
  dependence = NA,
  dependence_value = NA,
  required = TRUE
  #page = c(rep(1, 214), rep(2, 54), rep(3, 54), rep(4, 54))
)

#View(questions)

#questions <- read.csv2(file = "questions.txt",header = TRUE, sep = ";")


#write.csv(x = questions, sep = ";",file = "111.txt")

extendInputType("picker", { shinyWidgets::pickerInput(inputId =  surveyID(),
            label = surveyLabel(),
            selected = NULL,
            multiple = TRUE,
            options = pickerOptions(style = "my-class", maxOptions = 1, noneSelectedText ="відділення"),
            choices = surveyOptions(),
            choicesOpt = list(content = paste0("<img src='accordbank.svg' width=15px> ", surveyOptions(), "</img>")
            ))})

extendInputType("PIBselector", { selectizeInput(
  inputId = surveyID(), 
  label = surveyLabel(),
  multiple = FALSE,
  choices = c("Search Bar" = "", surveyOptions()),
  options = list(
    create = FALSE,
    placeholder = "Пошук працівника",
    maxItems = '1',
    onDropdownOpen = I("function($dropdown) {if (!this.lastQuery.length) {this.close(); this.settings.openOnFocus = false;}}"),
    onType = I("function (str) {if (str === \"\") {this.close();}}")
  )
)})


#choicesOpt = list(content = c("<img src='accordbank.svg' width=15px> 1 відділення</img>",
 #                             "<img src='accordbank.svg' width=15px> 2 відділення</img>",
  #                            "<img src='accordbank.svg' width=15px> 3 відділення</img>"

ui <- shiny::fluidPage(use_shiny_title(),
  #shinysurveys::teaching_r_questions
  shinysurveys::surveyOutput(df = questions,
                             survey_title = div(img(src="accordbank.svg", height = 35, width = 35), "Опитування"),
                             survey_description = 'ПО ПРОДУКТУ БАНКУ ЩОДО ЗОВНІШНЬОЕКОНОМІЧНИХ ОПЕРАЦІЙ ЮРИДИЧНИХ ОСІБ/ФОП (ЗЕД), ТОБТО  ОПЕРАЦІЇ БЕЗГОТІВКОВОЇ КУПІВЛІ АБО ПРОДАЖУ ВАЛЮТИ КЛІЄНТАМИ БАНКУ',theme = "#7B1818"),
  
  useShinyjs(),
  tags$head(
    HTML("
                     <meta name='viewport' content= 'width=device-width, initial-scale=1.0'>
                     <link rel='shortcut icon' sizes='16x16' href='accordbank.svg'>
                 ")
  ),
  
  tags$head(
    tags$style(
      HTML("#shiny-notification-panel {
             top: 0;
  bottom: unset;
  left: 0;
  right: 0;
  margin-left: auto;
  margin-right: auto;
  width: 100%;
  max-width: 450px;
  opacity:1;
             }
             "
      )
    )
  ),

  
  tags$body(
    HTML(
      "
          <script>
              document.getElementById('submit').innerHTML = 'Відправити';
          </script>
          
          "
    )
  ),

  
  tags$body(
    HTML(
      "
          <script>
          
              var iDiv1 = document.createElement('div');
              iDiv1.id = 'title-description-1';
              iDiv1.className = 'title-description';
              var iDiv1_1 = document.createElement('h1');
              iDiv1_1.id = 'survey-title1';
              var iDiv1_2 = document.createElement('p');
              iDiv1_2.id = 'survey-description1';
              
              document.getElementById('q21-question').before(iDiv1)
              document.getElementById('title-description-1').appendChild(iDiv1_1)
              document.getElementById('title-description-1').appendChild(iDiv1_2)
              document.getElementById('survey-description1').innerHTML = 'ОПИТУВАННЯ ПО ПРОДУКТУ БАНКУ ВІДКРИТТЯ ПОТОЧНИХ РАХУНКІВ ТА РКО ЮРИДИЧНИХ ОСІБ';

              var iDiv1_1_1 = document.createElement('div');
              iDiv1_1_1.id = 'div1';
              document.getElementById('survey-title1').appendChild(iDiv1_1_1);
              document.getElementById('div1').innerHTML = '<img width=\"35\" height=\"35\" src=\"accordbank.svg\">             Опитування            ';
              

              
              
              
              var iDiv3 = document.createElement('div');
              iDiv3.id = 'title-description-2';
              iDiv3.className = 'title-description';
              var iDiv3_3 = document.createElement('h1');
              iDiv3_3.id = 'survey-title2';
              var iDiv3_4 = document.createElement('p');
              iDiv3_4.id = 'survey-description2';
              
              document.getElementById('q31-question').before(iDiv3)
              document.getElementById('title-description-2').appendChild(iDiv3_3)
              document.getElementById('title-description-2').appendChild(iDiv3_4)
              document.getElementById('survey-description2').innerHTML = 'ОПИТУВАННЯ ПО ПРОДУКТУ БАНКУ «ПРИЙОМ ПЛАТЕЖІВ ВІД НАСЕЛЕННЯ» ( фіз особи)';

              var iDiv3_3_3 = document.createElement('div');
              iDiv3_3_3.id = 'div3';
              document.getElementById('survey-title2').appendChild(iDiv3_3_3);
              document.getElementById('div3').innerHTML = '<img width=\"35\" height=\"35\" src=\"accordbank.svg\">             Опитування            ';
              



              var iDiv5 = document.createElement('div');
              iDiv5.id = 'title-description-3';
              iDiv5.className = 'title-description';
              var iDiv5_5 = document.createElement('h1');
              iDiv5_5.id = 'survey-title3';
              var iDiv5_6 = document.createElement('p');
              iDiv5_6.id = 'survey-description3';
              
              document.getElementById('q41-question').before(iDiv5)
              document.getElementById('title-description-3').appendChild(iDiv5_5)
              document.getElementById('title-description-3').appendChild(iDiv5_6)
              document.getElementById('survey-description3').innerHTML = 'ОПИТУВАННЯ ПО ПРОДУКТУ БАНКУ «СТРОКОВІ ДЕПОЗИТИ ФІЗ ОСІБ»';

              var iDiv5_5_5 = document.createElement('div');
              iDiv5_5_5.id = 'div5';
              document.getElementById('survey-title3').appendChild(iDiv5_5_5);
              document.getElementById('div5').innerHTML = '<img width=\"35\" height=\"35\" src=\"accordbank.svg\">             Опитування            ';
              

              document.getElementById('survey-description').setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;');



              var iDiv11 = document.createElement('div');
              iDiv11.id = 'q11';
              iDiv11.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q11').before(iDiv11);
              document.getElementById('q11').innerHTML = 'ОЦІНІТЬ ВАШІ ЗНАННЯ/ ЗНАННЯ  ВАШИХ ПІДЛЕГЛИХ ЗА НАПРЯМОМ ЗЕД (ОПЕРАЦІЇ ПРОДАЖУ КУПІВЛІ БЕЗГОТІВКОВОЇ ІНОЗЕМНОЇ ВАЛЮТИ)';
              
              
              
              var iDiv12 = document.createElement('div');
              iDiv12.id = 'q12';
              iDiv12.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q12').before(iDiv12);
              document.getElementById('q12').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ТА ПОСТІЙНУ ЩОДЕННУ РОБОТУ ПО ЗАЛУЧЕННЮ КЛІЄНТІВ НА ЦЕЙ НАПРЯМ';
              
              
              var iDiv13 = document.createElement('div');
              iDiv13.id = 'q13';
              iDiv13.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q13').before(iDiv13);
              document.getElementById('q13').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ЗДІЙСНЮВАТИ КОМУНІКАЦІЮ ПО ЦЬОМУ НАПРЯМУ В СЕРЕДИНІ БАНКУ, З ДЕПАРТАМЕНТОМ ВАЛЮТНОГО НАГЛЯДУ, УФМ ТОЩО, ДЛЯ ВИРІШЕННЯ СКЛАДНИХ ПИТАНЬ ПО КЛІЄНТУ';


              var iDiv21 = document.createElement('div');
              iDiv21.id = 'q21';
              iDiv21.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q21').before(iDiv21);
              document.getElementById('q21').innerHTML = 'ОЦІНІТЬ ВАШЕ ЗНАННЯ/ЗНАННЯ ВАШИХ ПІДЛЕГЛИХ  НАПРЯМУ СПІВПРАЦІ З ЮРИДИЧНИМИ ОСОБАМИ - РОЗРАХУНКОВО-КАСОВОГО ОБСЛУГОВУВАННЯ ЮР.ОСІБ';
              
              
              
              var iDiv22 = document.createElement('div');
              iDiv22.id = 'q22';
              iDiv22.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q22').before(iDiv22);
              document.getElementById('q22').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ТА ПОСТІЙНУ ЩОДЕННУ РОБОТУ ПО ЗАЛУЧЕННЮ НОВИХ КЛІЄНТІВ (ЮР.ОСІБ) НА ВІДКРИТТЯ РАХУНКІВ У БАНКУ, У Т.Ч. ДЛЯ РКО';
              

              var iDiv23 = document.createElement('div');
              iDiv23.id = 'q23';
              iDiv23.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q23').before(iDiv23);
              document.getElementById('q23').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ЗДІЙСНЮВАТИ КОМУНІКАЦІЮ ПО ЦЬОМУ НАПРЯМУ В СЕРЕДИНІ БАНКУ, З ВІДДІЛАМИ KYC, УФМ ТА ІНШИМИ';
              
              
              
              var iDiv31 = document.createElement('div');
              iDiv31.id = 'q31';
              iDiv31.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q31').before(iDiv31);
              document.getElementById('q31').innerHTML = 'ОЦІНІТЬ ВАШЕ ЗНАННЯ/ЗНАННЯ ВАШИХ ПІДЛЕГЛИХ ПРОДУКТУ -  ПРИЙОМ ПЛАТЕЖІВ ВІД НАСЕЛЕННЯ';
              
              
              var iDiv32 = document.createElement('div');
              iDiv32.id = 'q32';
              iDiv32.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q32').before(iDiv32);
              document.getElementById('q32').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ТА ПОСТІЙНУ ЩОДЕННУ РОБОТУ ПО ЗАЛУЧЕННЮ КЛІЄНТІВ НА ЦЕЙ ПРОДУКТ';
              
              
              
              var iDiv33 = document.createElement('div');
              iDiv33.id = 'q33';
              iDiv33.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q33').before(iDiv33);
              document.getElementById('q33').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ЗДІЙСНЮВАТИ КОМУНІКАЦІЮ ПО ЦЬОМУ НАПРЯМУ В СЕРЕДИНІ БАНКУ, З ДЕПАРТАМЕНТОМ РОЗВИТКУ РОЗРАХУНКОВИХ ОПЕРАЦІЙ ТА ДЕПОЗИТНИХ ПРОДУКТІВ, УФМ, ОПЕРАЦІЙНИМ ДЕПАРТАМЕНТОМ ТОЩО, ДЛЯ ВИРІШЕННЯ СКЛАДНИХ ПИТАНЬ ПО КЛІЄНТУ';
              
              
              
              var iDiv41 = document.createElement('div');
              iDiv41.id = 'q41';
              iDiv41.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q41').before(iDiv41);
              document.getElementById('q41').innerHTML = 'ОЦІНІТЬ ВАШЕ ЗНАННЯ/ЗНАННЯ ВАШИХ ПІДЛЕГЛИХ ПРОДУКТУ -  СТРОКОВІ ДЕПОЗИТИ ФІЗ ОСІБ';
              
              
              var iDiv42 = document.createElement('div');
              iDiv42.id = 'q42';
              iDiv42.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q42').before(iDiv42);
              document.getElementById('q42').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ТА ПОСТІЙНУ ЩОДЕННУ РОБОТУ ПО ЗАЛУЧЕННЮ КЛІЄНТІВ НА ЦЕЙ ПРОДУКТ';
              
              
              
              var iDiv43 = document.createElement('div');
              iDiv43.id = 'q43';
              iDiv43.setAttribute('style', 'text-align: center;margin: 2px;font-size: 1.0rem;font-weight: bold;color:#D22B2B');
              
              document.getElementById('q43').before(iDiv43);
              document.getElementById('q43').innerHTML = 'ОЦІНІТЬ ВАШЕ ВМІННЯ/ВМІННЯ ВАШИХ ПІДЛЕГЛИХ ЗДІЙСНЮВАТИ КОМУНІКАЦІЮ ПО ЦЬОМУ НАПРЯМУ В СЕРЕДИНІ БАНКУ, З ДЕПАРТАМЕНТОМ РОЗВИТКУ РОЗРАХУНКОВИХ ОПЕРАЦІЙ ТА ДЕПОЗИТНИХ ПРОДУКТІВ, УФМ, ОПЕРАЦІЙНИМ ДЕПАРТАМЕНТОМ  ТОЩО, ДЛЯ ВИРІШЕННЯ СКЛАДНИХ ПИТАНЬ ПО КЛІЄНТУ';
              
              
          </script>
          
          "
    )
  ),
 
  
  tags$body(tags$style("#submit {color: white;background-color: grey;} ")),
  tags$body(tags$style("#survey-title {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
  tags$body(tags$style("#survey-title1 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
  tags$body(tags$style("#survey-title2 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
  tags$body(tags$style("#survey-title3 {text-align: center;margin-top: 20px;margin-bottom: 12px;} ")),
  tags$body(tags$style("#survey-description1 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
  tags$body(tags$style("#survey-description2 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
  tags$body(tags$style("#survey-description3 {text-align: center;margin: 2px;font-size: 1.2rem;font-weight: bold;} ")),
  tags$body(tags$style("table {font-size: 10px;} ")),
  tags$head(tags$style("input[type=radio] {accent-color: red;};} ")),
 
)

server <- function(input, output, session) {
  shinysurveys::renderSurvey()
  change_window_title(session, "Опитування")
  flashing_window_title( session, "Акордбанк", inactive_only = TRUE, interval = 1000 )
  
  observeEvent(input$submit, {

    showModal(modalDialog(footer = NULL,
      title = "Ваші відповіді надіслано! Дякуємо за участь в опитуванні!",
      #"You can customize what actions happen when a user finishes a survey using input$submit."
    ))
    
    print("clicked save!!!")

    ssql <- "INSERT INTO questionare (division, PIB, q11ker, q12ker, q13ker, q21ker, q22ker, q23ker, q31ker, q32ker, q33ker, q41ker, q42ker, q43ker) "
    

    data <- DBI::dbGetQuery(pool,  paste0(ssql,"VALUES('", input$division,"','", input$PIB,"','", input$q11[1,3],
                                          "','", input$q12[1,3],
                                          "','", input$q13[1,3],
                                          "','", input$q21[1,3],
                                          "','", input$q22[1,3],
                                          "','", input$q23[1,3],
                                          "','", input$q31[1,3],
                                          "','", input$q32[1,3],
                                          "','", input$q33[1,3],
                                          "','", input$q41[1,3],
                                          "','", input$q42[1,3],
                                          "','", input$q43[1,3],"')"))
    #showNotification("Ваші відповіді надіслано! Дякуємо за участь в опитуванні!",duration = 4,closeButton = FALSE, type = "error",id = "info")
    #print(getSurveyData())


  })
  
  observeEvent(input$PIB, {
    validate(need(input$PIB, 'Check at least one letter!'),)
  })
  
  
}

shiny::shinyApp(ui = ui, server = server)